app/views/events/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
---
                # Retreive the companytoevent
                c2e =  company.companytoevents.where("event_id = '" + @event.id.to_s + "'").first