app/views/companies/index.html.erb

              <%
              if company.companytoevents.where("event_id = '" + ev.id.to_s + "'").blank? then
---
SELECT "companytoevents".* FROM "companytoevents" WHERE "companytoevents"."event_id" = 1 AND (event_id = 1)
SELECT "events".* FROM "events" WHERE (date_start > '2012-12-14 21:21:23')
SELECT COUNT(*) FROM "companytoevents" WHERE "companytoevents"."event_id" = 1 AND (event_id = 1 AND company_id = 1)

                # Retreive the companytoevent
                c2e =  company.companytoevents.where("event_id = '" + params[:event_id].to_s + "'").first
---
SELECT "companies".* FROM "companies" WHERE (id in (select company_id from companytoevents where event_id = '5')) LIMIT 10 OFFSET 0