app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
SELECT "events".* FROM "events" WHERE (date_start > '2012-12-14 21:21:23')
SELECT "companies".* FROM "companies" WHERE (id in (select company_id from companytoevents where event_id = '5')) LIMIT 10 OFFSET 0
---
  def index
    @companies = Company.all
    @events = Event.all
    if params[:search].present?
      @search = Company.search(params[:search])
      @companies = @search.paginate(:page => params[:page], :per_page => 3)

INSERT INTO "companies" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 22 Nov 2012 21:42:34 UTC +00:00], ["updated_at", Thu, 22 Nov 2012 21:42:34 UTC +00:00]]
---
  def create
    @company = Company.new(params[:company])

    if @company.save

SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "companies" SET "name" = 'Lesjeudis', "description" = 'blablou', "address" = '15C rue Francois Mermet, 69160 Tassin aussi', "website" = 'http://www.careerbuilder.com', "comment" = '', "updated_at" = '2012-12-14 20:17:29.802964' WHERE "companies"."id" = 2
---
  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(params[:company])