app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" LIMIT 10 OFFSET 0
---
  def index
    if params[:company_id].present?
      if params[:search].present?
        @search = Contact.where("company_id = " + params[:company_id]).search(params[:search])
        @contacts = @search.paginate(:page => params[:page], :per_page => 10)   # or @search.relation to lazy load in view // @search.paginate(:page => params[:page])

INSERT INTO "contacts" ("company_id", "created_at", "email", "login", "name", "password", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(params[:contact])

    if @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "contacts" SET "name" = 'Ludovic MAJERUS', "login" = 'mon login', "phone" = '0663042595', "updated_at" = '2012-12-14 22:42:42.719666' WHERE "contacts"."id" = 1
---
  def update
    @contact = Contact.find(params[:id])
    if @contact.update_attributes(params[:contact])

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 3]]
---
  def destroy
    @contact = Contact.find(params[:id])
    company_id = @contact.company_id
    @contact.destroy