app/controllers/events_controller.rb

  def edit
    @event = Event.find(params[:id])
    @event_detail = Event.find(params[:id]).event_detail
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "event_details".* FROM "event_details" WHERE "event_details"."event_id" = 1 AND (key='ed:location') LIMIT 1

  def create
    @event = Event.new(params[:event])

    if @event.save
      params.each do |key, value|
        if (key.to_s[/ed:*/])
          ed =  EventDetail.new
          ed.event_id = @event.id
          ed.key = key
          ed.value = value
          ed.save
---
INSERT INTO "events" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 23 Nov 2012 09:54:28 UTC +00:00], ["updated_at", Fri, 23 Nov 2012 09:54:28 UTC +00:00]]
INSERT INTO "event_details" ("created_at", "event_id", "key", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 26 Nov 2012 21:53:41 UTC +00:00], ["event_id", 4], ["key", "ed:subscription_open"], ["updated_at", Mon, 26 Nov 2012 21:53:41 UTC +00:00], ["value", "true"]]

  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])
      @event.event_detail.destroy_all
      params.each do |key, value|
        if (key.to_s[/ed:*/])
          ed =  EventDetail.new
          ed.event_id = @event.id
          ed.key = key
          ed.value = value
          ed.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "event_details" WHERE "event_details"."id" = ?  [["id", 3]]
SELECT "event_details".* FROM "event_details" WHERE "event_details"."event_id" = 1
INSERT INTO "event_details" ("created_at", "event_id", "key", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 26 Nov 2012 17:29:45 UTC +00:00], ["event_id", 1], ["key", "ed:location"], ["updated_at", Mon, 26 Nov 2012 17:29:45 UTC +00:00], ["value", "yoyo"]]