app/controllers/jobseekers_controller.rb

  def index
    @jobseekers = Jobseeker.all
---
SELECT "jobseekers".* FROM "jobseekers"